vtypes = ['', '亚洲无码', '亚洲有码', '欧美情色', '中文字幕', '动漫卡通', '美女主播',
          '人妻熟女', '强奸乱伦', '日韩伦理', '国产自拍', '网友自拍', '卡通漫画',
          '露出激情', '亚洲性爱', '丝袜美腿', '欧美风情', '清纯唯美', '科学幻想',
          '学生校园', '玄幻仙侠', 'GIF动图', '精选口爆', '同性同志', '重口味',
          '经验故事', '明星偶像', '不伦恋情', '暴力虐待', '生活都市', '美女写真',
          '韩国主播', 'JAV 4K', '91大神', 'AV解说', '国外热门资源', '精品海外欧美资源',
          '精品海外亚洲资源']

vtypesd = ['', '亚洲无码,日韩', '亚洲有码,日韩', '欧美情色', '中文字幕', '动漫卡通', '美女主播,国产,亚洲',
          '人妻熟女,亚洲', '强奸乱伦,亚洲', '日韩伦理,亚洲', '国产自拍', '网友自拍,国产', '卡通漫画,动漫',
          '露出激情', '亚洲性爱', '丝袜美腿', '欧美风情', '清纯唯美', '科学幻想',
          '学生校园', '玄幻仙侠', 'GIF动图', '精选口爆', '同性同志', '重口味',
          '经验故事', '明星偶像', '不伦恋情', '暴力虐待', '生活都市', '美女写真',
          '韩国主播,日韩', 'JAV 4K', '91大神', 'AV解说', '国外热门资源', '精品海外欧美资源',
          '精品海外亚洲资源']

def get_type_id(type_s):
    return vtypes.index(type_s)


def get_type_s(type_id):
    return vtypes[type_id]
